In [13]:
os.listdir("car")

['audi.csv',
 'bmw.csv',
 'cclass.csv',
 'focus.csv',
 'ford.csv',
 'hyundi.csv',
 'merc.csv',
 'skoda.csv',
 'toyota.csv',
 'unclean cclass.csv',
 'unclean focus.csv',
 'vauxhall.csv',
 'vw.csv']

In [1]:
import os
import pandas as pd

In [7]:
df_car = pd.read_csv("car/audi.csv")
df_car.head(2)

  model  year  price transmission  mileage fuelType  tax   mpg  engineSize
0    A1  2017  12500       Manual    15735   Petrol  150  55.4         1.4
1    A6  2016  16500    Automatic    36203   Diesel   20  64.2         2.0

In [11]:
folder = "car"
list_files = os.listdir(folder)

df_bind = pd.DataFrame()
for file in list_files:
    file_path = folder + "/" + file
    print(file_path)
    df_sub = pd.read_csv(file_path)
    df_bind = pd.concat([df_bind, df_sub])

car/audi.csv
car/bmw.csv
car/cclass.csv
car/focus.csv
car/ford.csv
car/hyundi.csv
car/merc.csv
car/skoda.csv
car/toyota.csv
car/unclean cclass.csv
car/unclean focus.csv
car/vauxhall.csv
car/vw.csv

In [12]:
len(df_bind)

118150

In [14]:
df_bind.head(2)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,tax(£),fuel type,engine size,mileage2,fuel type2,engine size2,reference
0,A1,2017.0,12500,Manual,15735,Petrol,150.0,55.4,1.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,A6,2016.0,16500,Automatic,36203,Diesel,20.0,64.2,2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
os.listdir()

['.ipynb_checkpoints', 'car', 'class_211026.ipynb', 'DS_lv1']

In [17]:
os.listdir("DS_lv1") # 파일목록

['AWS_sample.txt',
 'bank.csv',
 'bike.csv',
 'bike.json',
 'bike_rental.csv',
 'bike_weather.csv',
 'classification_data_01.csv',
 'class_scores.csv',
 'diabetes.csv',
 'diamonds.csv',
 'elec_load.csv',
 'iris_missing.csv',
 'iris_xlsx.xlsx',
 'join_list.csv',
 'join_room.csv',
 'linear_regression_01.csv',
 'logistic_regression_01.csv',
 'rating_chocobar.csv',
 'regex_example_df.csv',
 'traffic_accident.txt',
 'traffic_highway.csv']

In [24]:
import os
import pandas as pd

In [26]:
aws1 = pd.read_csv("DS_lv1/AWS_sample.txt")
aws1.head(2)

           AWS_ID#TM#TA#Wind#X.
0  108#2016-07-01 00#24.2#2.3#=
1  108#2016-07-01 01#24.3#2.3#=

In [30]:
aws2 = pd.read_csv("DS_lv1/AWS_sample.txt", sep = "#")
aws2.head()
# head 메소드는 기본적으로 위에서 부터 5개의 원소 또는 행을 출력
# tail 메소드는 기본적으로 마지막 5개의 원소 또는 행을 출력

   AWS_ID             TM    TA  Wind X.
0     108  2016-07-01 00  24.2   2.3  =
1     108  2016-07-01 01  24.3   2.3  =
2     108  2016-07-01 02  23.7   3.8  =
3     108  2016-07-01 03  23.3   3.0  =
4     108  2016-07-01 04  23.5   2.1  =

In [29]:
iris = pd.read_excel("DS_lv1/iris_xlsx.xlsx")
iris.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [31]:
!pip install openpyxl --user
!pip install xlrd --user

Requirement already satisfied: openpyxl in c:\users\tkdal\anaconda3\lib\site-packages (3.0.7)
Requirement already satisfied: et-xmlfile in c:\users\tkdal\anaconda3\lib\site-packages (from openpyxl) (1.0.1)
Requirement already satisfied: xlrd in c:\users\tkdal\anaconda3\lib\site-packages (2.0.1)

In [33]:
bike = pd.read_csv("DS_lv1/bike.csv")
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [36]:
bike["temp"].max()

41.0

In [37]:
bike["temp"].min()

0.82

In [38]:
bike["atemp"].max()

45.455

In [39]:
bike["atemp"].min()

0.76

In [44]:
bike[["temp", "atemp"]].max()

temp     41.000
atemp    45.455
dtype: float64

In [42]:
bike[["temp", "atemp"]].mean()

temp     20.230860
atemp    23.655084
dtype: float64

In [45]:
bike.loc[:, ["temp", "atemp"]].mean() # 열을 지정 후 각 열의 평균

temp     20.230860
atemp    23.655084
dtype: float64

In [47]:
bike.loc[:, ["temp", "atemp"]].mean().reset_index()

   index          0
0   temp  20.230860
1  atemp  23.655084

In [48]:
bike.loc[:3, ["temp", "atemp"]]

   temp   atemp
0  9.84  14.395
1  9.02  13.635
2  9.02  13.635
3  9.84  14.395

In [49]:
bike.loc[:3, ["temp", "atemp"]].mean(axis = 1) # 각 행에 있는 값들의 평균

0    12.1175
1    11.3275
2    11.3275
3    12.1175
dtype: float64

In [50]:
bike["season"].unique() # 중복제거(고유한 원소)

array([1, 2, 3, 4], dtype=int64)

In [51]:
bike["season"].nunique() # 고유한 원소의 개수

4

In [52]:
bike["season"].value_counts() # 각 고유한 원소의 등장 빈도

4    2734
2    2733
3    2733
1    2686
Name: season, dtype: int64

In [53]:
bike["season"].value_counts(normalize = True) # 각 고유한 원소의 등장 비율

4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: season, dtype: float64

In [54]:
bike["season"].value_counts(normalize = True).round(3) # + 소수점 셋째 자리까지 반올림

4    0.251
2    0.251
3    0.251
1    0.247
Name: season, dtype: float64

In [ ]:
bile["temp"].mean()

In [61]:
bike_temp_up20 = bike.loc[bike["temp"] >= 20, ] #<- 권장 x df.loc[row, col]
bike_temp_up20.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
746,2011-02-14 11:00:00,1,0,1,1,21.32,25.000,23,16.9979,10,43,53
747,2011-02-14 12:00:00,1,0,1,1,22.96,26.515,22,30.0026,27,99,126

In [56]:
len(bike)

10886

In [57]:
len(bike_temp_up20)

5578

In [58]:
sum(bike["temp"] >= 20) # True를 1로 계산학기 때문에 True 개수를 세는 것과 같음

5578

In [64]:
condi = (bike["season"] == 2) | (bike["season"] == 4) #계절이 2 또는 4
bike_s2_s4 = bike.loc[bike[condi, ["datetime", "season", "temp"]]
bike_s2_s4.head(2)

                 datetime  season   temp
1323  2011-04-01 00:00:00       2  10.66
1324  2011-04-01 01:00:00       2  10.66

In [82]:
bike_sub = bike.loc[(bike["workingday"] == 1) & (bike["humidity"] <= 60), ]
bike_sub.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
47,2011-01-03 00:00:00,1,0,1,1,9.02,9.850,44,23.9994,0,5,5
48,2011-01-03 01:00:00,1,0,1,1,8.20,8.335,44,27.9993,0,2,2

In [81]:
bike["temp"].quantile(0.25) #1Q

13.94

In [73]:
bike["temp"].quantile(0.5) #2Q(Median)

20.5

In [74]:
bike["temp"].quantile(0.75) #3Q

26.24

In [75]:
bike["temp"].quantile(0.01) # 제 1 백분위수 (하위 1%)

4.92

In [76]:
bike["temp"].quantile(0.99) # 제 99 백분위수(상위 1%)

29.52

In [86]:
ser1 = pd.Series([1, 2, pd.NA, 3])
ser1

0       1
1       2
2    <NA>
3       3
dtype: object

In [87]:
import numpy as np
ser2 = pd.Series([2, 4, 6, np.nan, 10])
ser2

0     2.0
1     4.0
2     6.0
3     NaN
4    10.0
dtype: float64

In [88]:
import pandas as pd

In [89]:
ser1 = pd.Series([1, 2, pd.NA, 3])

In [90]:
ser1.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [91]:
ser1.notna() #

0     True
1     True
2    False
3     True
dtype: bool

In [92]:
ser1.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [93]:
ser1.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [94]:
ser1[ser1.isna()]

2    <NA>
dtype: object

In [95]:
ser1[ser1.notna()]

0    1
1    2
3    3
dtype: object

In [96]:
ser1[ser1.isna()]

2    <NA>
dtype: object

In [97]:
ser1_notna = ser1[ser1.notna()] # 결측치를 제외한 나머지(결측치를 제거하는 효과)
ser1_notna

0    1
1    2
3    3
dtype: object

In [98]:
ser1[ser1.isna() == False]

0    1
1    2
3    3
dtype: object

In [109]:
import numpy as np
import pandas as pd

In [112]:
df = pd.read_csv("DS_lv1/iris_missing.csv")
df_sub = df.head()

Q1. Sepal.Length 변수의 결측치 개수는?

In [113]:
sum(df["Sepal.Length"].isna())

7

In [114]:
df["Sepal.Length"].isna().sum()

7

## df 객체의 결측치 개수 총합은?

In [115]:
df.isna().sum().reset_index()

          index   0
0  Sepal.Length   7
1   Sepal.Width  13
2  Petal.Length  14
3   Petal.Width   6
4       Species   0

In [120]:
df_na = pd.DataFrame()
for n in range(df.shape[1]):
    df.iloc[:, n].isna().sum()
    df_na_sub = pd.DataFrame({"colum": [df.columns[n]],
                              "na_count": [df.iloc[:, n].isna().sum()]})
    df_na = pd.concat([df_na, df_na_sub])
    
    
df_na

          colum  na_count
0  Sepal.Length         7
0   Sepal.Width        13
0  Petal.Length        14
0   Petal.Width         6
0       Species         0

In [122]:
df.head(10)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa
7           5.0          3.4           NaN          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           NaN          0.1  setosa

In [127]:
df_10 = df.iloc[:10, :-1] # 마지막 변수를 제외
df_10

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6           NaN          NaN           NaN          NaN
7           5.0          3.4           NaN          0.2
8           4.4          2.9           1.4          0.2
9           4.9          3.1           NaN          0.1

In [128]:
df_10.dropna() # 결측치가 하나라도 있는 row를 제거

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
8           4.4          2.9           1.4          0.2

In [129]:
df_10.dropna(how = "all") # 모든 column에 결측치가 있는 row만 제거

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
7           5.0          3.4           NaN          0.2
8           4.4          2.9           1.4          0.2
9           4.9          3.1           NaN          0.1

- 소괄호() : 수치 연산의 우선순위, 튜플의 생성, 함수 인자를 묶음
- 중괄호{} : 딕셔너리 생성
- 대괄호[] : 리스트 생성, 인덱싱

In [130]:
df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           NaN          2.5           NaN          NaN  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          NaN  virginica

In [131]:
df["Sepal.Length"].mean()

5.853846153846154

In [ ]:
df.loc[df["Sepal.Length"].isna()."Sepal.Length"] =

In [132]:
audi = pd.read_csv("car/audi.csv")
audi.head()

  model  year  price transmission  mileage fuelType  tax   mpg  engineSize
0    A1  2017  12500       Manual    15735   Petrol  150  55.4         1.4
1    A6  2016  16500    Automatic    36203   Diesel   20  64.2         2.0
2    A1  2016  11000       Manual    29946   Petrol   30  55.4         1.4
3    A4  2017  16800    Automatic    25952   Diesel  145  67.3         2.0
4    A3  2019  17300       Manual     1998   Petrol  145  49.6         1.0

In [133]:
audi_asc = audi.sort_values("price")
audi_asc.head()

      model  year  price transmission  mileage fuelType  tax   mpg  engineSize
10588    A3  2003   1490    Automatic   101000   Diesel  240  44.5         1.9
10552    A4  2004   1699       Manual   110000   Diesel  315  36.2         2.5
7795     A3  2005   1975       Manual   104000   Petrol  240  38.1         2.0
10108    TT  2002   1990       Manual   131925   Petrol  325  30.1         1.8
7404     A3  2009   2490       Manual   152034   Diesel  150  55.4         1.9

In [134]:
audi_desc = audi.sort_values("price", ascending = False)
audi_desc.head()

     model  year   price transmission  mileage fuelType  tax   mpg  engineSize
4783    R8  2020  145000    Semi-Auto     2000   Petrol  145  21.1         5.2
2255    R8  2020  137995    Semi-Auto       70   Petrol  145  21.1         5.2
4179    R8  2019  137500    Semi-Auto       10   Petrol  150  21.4         5.2
3367    R8  2019  135000    Automatic     1000   Petrol  145  32.8         5.2
5459    R8  2020  133900    Semi-Auto      333   Petrol  145  21.4         5.2

In [135]:
audi.head(2)

  model  year  price transmission  mileage fuelType  tax   mpg  engineSize
0    A1  2017  12500       Manual    15735   Petrol  150  55.4         1.4
1    A6  2016  16500    Automatic    36203   Diesel   20  64.2         2.0

In [136]:
audi["idx_pm"] = audi["price"] / audi["mileage"]
audi.head(2)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,idx_pm
0,A1,2017,12500,Manual,15735,Petrol,150,55.4,1.4,0.794407
1,A6,2016,16500,Automatic,36203,Diesel,20,64.2,2.0,0.455763

Q1. year는 차량 생산년도를 뜻한다. 연돔별 차량생산 대수를 파악하시오

Q2. 어떤 모델의 차량이 가장 많은가? 해당 모델의 비중을 반올림하여 소수점 첫 째자리 까지 출력하시오. 단, model 변수 참고

Q3. 세금(tax)는 차량 거래가격(Price)에 비례해서 붙는다고 한다. 차량 거래가격 대비 평균 세금의 비율은 얼마인가?

In [139]:
#Q1
audi["year"].value_counts()

2019    3197
2016    1964
2017    1935
2015     999
2018     864
2020     716
2014     447
2013     291
2012      85
2011      47
2010      32
2009      23
2008      21
2007      16
2006       9
2005       7
2003       6
2004       5
2002       2
1997       1
1998       1
Name: year, dtype: int64

In [147]:
#Q1 위에꺼도 맞고 밑에께 권고
audi_year_cnt = audi["year"].value_counts().reset_index()
audi_year_cnt.columns = ["year", "count"]
aoudi_year_cnt = audi_year_cnt.sort_values("year",ascending = False).reset_index(drop = True)
audi_year_cnt.head()

   year  count
0  2019   3197
1  2016   1964
2  2017   1935
3  2015    999
4  2018    864

In [154]:
#Q2

round(audi["model"].value_counts(normalize = True).max() * 100, 1)

18.1

In [155]:
#Q3

audi["tax_ratio"] = audi["tax"] / audi["price"]
audi.head(2)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,idx_pm,tax_ratio
0,A1,2017,12500,Manual,15735,Petrol,150,55.4,1.4,0.794407,0.012000
1,A6,2016,16500,Automatic,36203,Diesel,20,64.2,2.0,0.455763,0.001212

In [156]:
audi["tax_ratio"].mean()

0.006268187266283593

In [157]:
audi.head(2)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,idx_pm,tax_ratio
0,A1,2017,12500,Manual,15735,Petrol,150,55.4,1.4,0.794407,0.012000
1,A6,2016,16500,Automatic,36203,Diesel,20,64.2,2.0,0.455763,0.001212

In [182]:
audi_sub1 = audi.sample(n = 4)
audi_sub1

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,idx_pm,tax_ratio
1755,A6,2016,21880,Semi-Auto,15559,Diesel,150,56.5,2.0,1.406260,0.006856
2462,A4,2017,19220,Manual,14378,Diesel,30,67.3,2.0,1.336765,0.001561
3840,A1,2019,18500,Manual,3500,Petrol,150,51.4,1.0,5.285714,0.008108
1438,A6,2013,13695,Semi-Auto,46206,Diesel,145,55.4,3.0,0.296390,0.010588

In [193]:
audi_sub2 = audi.sample(n = 4, random_state = 123) # 샘플링을 반복해도 항상 같은것을 샘플링한다.
audi_sub2

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,idx_pm,tax_ratio
7439,A4,2012,9995,Manual,70950,Diesel,200,46.3,2.0,0.140874,0.020010
9632,A1,2012,6790,Manual,65794,Diesel,0,74.3,1.6,0.103201,0.000000
1131,Q3,2019,32500,Semi-Auto,4444,Diesel,145,38.7,2.0,7.313231,0.004462
7625,A3,2019,23444,Automatic,1500,Petrol,145,44.1,0.0,15.629333,0.006185

In [213]:
audi_sub3 = audi.sample(frac = 0.2, random_state = 123) #frac : 비율 20%
print(len(audi_sub3)) 
audi_sub3.head()

2134

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,idx_pm,tax_ratio
7439,A4,2012,9995,Manual,70950,Diesel,200,46.3,2.0,0.140874,0.020010
9632,A1,2012,6790,Manual,65794,Diesel,0,74.3,1.6,0.103201,0.000000
1131,Q3,2019,32500,Semi-Auto,4444,Diesel,145,38.7,2.0,7.313231,0.004462
7625,A3,2019,23444,Automatic,1500,Petrol,145,44.1,0.0,15.629333,0.006185
1060,Q2,2019,25888,Automatic,4444,Petrol,145,42.2,1.5,5.825383,0.005601

In [215]:
bike = pd.read_csv("DS_lv1/bike.csv")
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [221]:
bike = bike.set_index("datetime") # 특정변수를 인덱스로 만든다. 
bike.head(2)

AttributeError: module 'pandas' has no attribute 'set_index'

In [222]:
ser = pd.Series([1, 2, 3, 4])
ser

0    1
1    2
2    3
3    4
dtype: int64

In [223]:
ser.astype("str")

0    1
1    2
2    3
3    4
dtype: object

In [226]:
import numpy as np
import pandas as pd
df = pd.read_csv("DS_lv1/bike.csv")
df_1 = df.head()
df_2 = df.tail()

In [227]:
df_bind = pd.concat([df_1, df_2])
df_bind.shape

(10, 12)

In [228]:
pd.concat([df_1, df_2], axis = 1)
pd.concat([df_1, df_2.reset_index(drop = True)], axis = 1)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,...,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,...,0,1,1,15.58,19.695,50,26.0027,7,329,336
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,...,0,1,1,14.76,17.425,57,15.0013,10,231,241
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,...,0,1,1,13.94,15.910,61,15.0013,4,164,168
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,...,0,1,1,13.94,17.425,61,6.0032,12,117,129
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,...,0,1,1,13.12,16.665,66,8.9981,4,84,88

In [230]:
df_list = pd.read_csv("DS_lv1/join_list.csv", encoding = "CP949")
df_room = pd.read_csv("DS_lv1/join_room.csv", encoding = "CP949")

In [231]:
df_list.head(2)

    team    No member
0  TWICE  1287     미나
1  TWICE  1788     나연

In [232]:
df_room.head(2)

   floor  room name
0      3  3G-A   미나
1      3  3G-B   나연

In [233]:
df_list.merge(df_room, left_on = "member", right_on = "name", how = "inner")
#프레임을 각 데이터가 존재하는 고유값(key)을 기준으로 병합할 때 사용한다.

    team    No member  floor  room name
0  TWICE  1287     미나      3  3G-A   미나
1  TWICE  1788     나연      3  3G-B   나연
2  TWICE  1408     다현      3  3G-C   다현
3  TWICE  1881     정연      4  4G-A   정연
4  TWICE  1937     지효      4  4G-B   지효
5  TWICE  1045     채연      4  4G-C   채연
6  TWICE  1525     모모      5  5G-A   모모
7  TWICE  1887     쯔위      5  5G-B   쯔위
8  TWICE  1547     사나      5  5G-C   사나

In [242]:
bank = pd.read_csv("DS_lv1/bank.csv", sep = ";")
bank.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no

In [243]:
bank.groupby("job")["balance"].mean()

job
admin.           1226.736402
blue-collar      1085.161734
entrepreneur     1645.125000
housemaid        2083.803571
management       1766.928793
retired          2319.191304
self-employed    1392.409836
services         1103.956835
student          1543.821429
technician       1330.996094
unemployed       1089.421875
unknown          1501.710526
Name: balance, dtype: float64

In [244]:
bank.groupby("job")["balance"].mean().reset_index()

              job      balance
0          admin.  1226.736402
1     blue-collar  1085.161734
2    entrepreneur  1645.125000
3       housemaid  2083.803571
4      management  1766.928793
5         retired  2319.191304
6   self-employed  1392.409836
7        services  1103.956835
8         student  1543.821429
9      technician  1330.996094
10     unemployed  1089.421875
11        unknown  1501.710526

In [246]:
bank.groupby(["job", "marital"])[["balance"]].mean().reset_index()

              job   marital      balance
0          admin.  divorced   977.811594
1          admin.   married  1353.266917
2          admin.    single  1111.482517
3     blue-collar  divorced   744.797468
4     blue-collar   married  1064.360750
5     blue-collar    single  1322.540230
6    entrepreneur  divorced   889.750000
7    entrepreneur   married  1612.825758
8    entrepreneur    single  2462.600000
9       housemaid  divorced  1166.230769
10      housemaid   married  1759.464286
11      housemaid    single  4695.333333
12     management  divorced  1432.352941
13     management   married  1858.082585
14     management    single  1729.529010
15        retired  divorced  1771.465116
16        retired   married  2383.857955
17        retired    single  3425.636364
18  self-employed  divorced  2572.066667
19  self-employed   married  1350.944882
20  self-employed    single  1089.268293
21       services  divorced   931.564516
22       services   married  1228.025424
23       services    single   947.722689
24        student   married   468.300000
25        student    single  1689.162162
26     technician  divorced   845.786517
27     technician   married  1436.919708
28     technician    single  1329.686567
29     unemployed  divorced   842.909091
30     unemployed   married  1131.586667
31     unemployed    single  1162.354839
32        unknown  divorced   137.000000
33        unknown   married  1275.933333
34        unknown    single  2664.285714

In [248]:
ser_time = pd.Series(["2021-10-26", "2021-10-27"])
ser_time

0    2021-10-26
1    2021-10-27
dtype: object

In [249]:
pd.to_datetime(ser_time)

0   2021-10-26
1   2021-10-27
dtype: datetime64[ns]

In [254]:
ser_time2  = pd.Series(["2021년 10월 26일", "2021년 10월 27일"])
ser_time2

0    2021년 10월 26일
1    2021년 10월 27일
dtype: object

In [255]:
pd.to_datetime(ser_time2, format = "%Y년 %m월 %d일")
# %Y : 4자리 연도 , %m : 월(숫자), %d : 일

0   2021-10-26
1   2021-10-27
dtype: datetime64[ns]

In [268]:
ser = pd.to_datetime(pd.Series([1, 2, 10000, 40000, 45000]), unit = "D", origin = "1970-01-01")
ser

0   1970-01-02
1   1970-01-03
2   1997-05-19
3   2079-07-08
4   2093-03-16
dtype: datetime64[ns]

In [269]:
ser.dt.year

0    1970
1    1970
2    1997
3    2079
4    2093
dtype: int64

In [270]:
ser.dt.month

0    1
1    1
2    5
3    7
4    3
dtype: int64

In [271]:
bike = pd.read_csv("DS_lv1/bike.csv")
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [288]:
bike_sub = bike[["datetime", "casual"]]
bike_sub.head(2)

             datetime  casual
0 2011-01-01 00:00:00       3
1 2011-01-01 01:00:00       8

Q1 datetime 변수를 문자형에서 시간형식으로 변환하시오

Q2 년/월/일/요일 변수를 각각 year/month/day/wday 변수로 bike_sub 객체에서 생성하시오

Q3 월별 casual의 총합을 산출하여 DateFrame 객체로 bike_m_casual 객체에 저장하시오

Q4 주중과 주말을 구분하는 is_wend변수를 bike_sub 객체에 생성하시오

In [290]:
#Q1

bike["datetime"] = pd.to_datetime(bike.datetime)

In [292]:
#Q1

bike_sub["datetime"].dtype
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  10886 non-null  datetime64[ns]
 1   casual    10886 non-null  int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 170.2 KB

In [295]:
bike_sub["datetime"] = pd.to_datetime(bike_sub["datetime"])
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  10886 non-null  datetime64[ns]
 1   casual    10886 non-null  int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 170.2 KB

<ipython-input-295-47ad44aa9449>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_sub["datetime"] = pd.to_datetime(bike_sub["datetime"])

In [308]:
#Q2

bike_sub["year"] = bike_sub["datetime"].dt.year
bike_sub["month"] = bike_sub["datetime"].dt.month
bike_sub["day"] = bike_sub["datetime"].dt.day
bike_sub["wday"] = bike_sub["datetime"].dt.weekday

<ipython-input-308-0f8df0776de4>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_sub["year"] = bike_sub["datetime"].dt.year
<ipython-input-308-0f8df0776de4>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_sub["month"] = bike_sub["datetime"].dt.month
<ipython-input-308-0f8df0776de4>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_sub["day"] = bike_sub["datetime"].dt.day
<ipython-input-308-0f8df0776de4>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_sub["wday"] = bike_sub["datetime"].dt.weekday

In [309]:
bike_sub.head(2)

             datetime  casual  year  month  day  wday  is_wend
0 2011-01-01 00:00:00       3  2011      1    1     5        1
1 2011-01-01 01:00:00       8  2011      1    1     5        1

In [302]:
#Q3
bike_m_casual = bike_sub.groupby("month")["casual"].sum().reset_index()
bike_m_casual.head(2)

   month  casual
0      1    7252
1      2    9297

In [306]:
#Q3

import numpy as np

bike_sub["is_wend"] = np.where(bike_sub["wday"].isin([5, 6]), 1, 0)
bike_sub["is_wend"] = np.where(bike_sub["wday"] >= 5, 1, 0)
bike_sub["is_wend"] = (bike_sub["wday"] >= 5) + 0
bike_sub["is_wend"] = (bike_sub["wday"] >= 5) * 1

<ipython-input-306-a0f87e19e4a0>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_sub["is_wend"] = np.where(bike_sub["wday"].isin([5, 6]), 1, 0)
<ipython-input-306-a0f87e19e4a0>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_sub["is_wend"] = np.where(bike_sub["wday"] >= 5, 1, 0)
<ipython-input-306-a0f87e19e4a0>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_sub["is_wend"] = (bike_sub["wday"] >= 5) + 0
<ipython-input-306-a0f87e19e4a0>:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_sub["is_wend"] = (bike_sub["wday"] >= 5) * 1

In [307]:
bike_sub["is_wend"] = (bike_sub["wday"] >= 5) + 0

<ipython-input-307-034ae2eebb55>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bike_sub["is_wend"] = (bike_sub["wday"] >= 5) + 0

In [305]:
bike_sub.head(2)

             datetime  casual  year  month  day  wday  is_wend
0 2011-01-01 00:00:00       3  2011      1    1     5        1
1 2011-01-01 01:00:00       8  2011      1    1     5        1

In [311]:
dia = pd.read_csv("DS_lv1/diamonds.csv")
dia.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [312]:
dia["color"].value_counts()

G    11292
E     9797
F     9542
H     8304
D     6775
I     5422
J     2808
Name: color, dtype: int64

In [313]:
pd.crosstab(dia["color"], dia["cut"], normalize = True)

cut        Fair      Good     Ideal   Premium  Very Good
color
D      0.003022  0.012273  0.052540  0.029718   0.028050
E      0.004153  0.017297  0.072358  0.043326   0.044494
F      0.005784  0.016852  0.070931  0.043215   0.040119
G      0.005821  0.016148  0.090545  0.054208   0.042621
H      0.005617  0.013014  0.057749  0.043752   0.033815
I      0.003244  0.009677  0.038802  0.026474   0.022321
J      0.002206  0.005692  0.016611  0.014980   0.012570

In [314]:
pd.crosstab(dia["color"], dia["cut"], normalize = 0)

cut        Fair      Good     Ideal   Premium  Very Good
color
D      0.024059  0.097712  0.418303  0.236605   0.223321
E      0.022864  0.095233  0.398387  0.238542   0.244973
F      0.032698  0.095263  0.400964  0.244288   0.226787
G      0.027807  0.077134  0.432519  0.258944   0.203595
H      0.036488  0.084538  0.375120  0.284200   0.219653
I      0.032276  0.096274  0.386020  0.263371   0.222058
J      0.042379  0.109330  0.319088  0.287749   0.241453

In [315]:
pd.crosstab(dia["color"], dia["cut"], normalize = 1)

cut        Fair      Good     Ideal   Premium  Very Good
color
D      0.101242  0.134937  0.131502  0.116235   0.125228
E      0.139130  0.190175  0.181105  0.169458   0.198643
F      0.193789  0.185283  0.177532  0.169023   0.179109
G      0.195031  0.177538  0.226625  0.212022   0.190283
H      0.188199  0.143090  0.144541  0.171126   0.150968
I      0.108696  0.106400  0.097118  0.103546   0.099652
J      0.073913  0.062576  0.041576  0.058589   0.056117

In [316]:
elec = pd.read_csv("DS_lv1/elec_load.csv")
elec.head(2)

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2008,1,1,39638,37682,35801,34154,33068,32529,31982,...,28147,28313,28683,30921,32879,33038,34031,34684,37444,38160
1,2008,1,2,37425,35239,33568,32171,31616,31725,32575,...,38213,38132,38399,39796,40810,39980,40084,39630,42008,42150

In [317]:
elec.loc[:2, "X7HR":"X15HR"]

    X7HR   X8HR   X9HR  X10HR  X11HR  X12HR  X13HR  X14HR  X15HR
0  31982  30961  28323  27869  28172  28501  28202  28227  28147
1  32575  34090  35604  37967  38853  39103  36666  37691  38213
2  35563  36489  37243  39232  39720  39755  37143  37412  37355

In [320]:
elec.iloc[0, ].reset_index()

    index      0
0    YEAR   2008
1   MONTH      1
2     DAY      1
3    X1HR  39638
4    X2HR  37682
5    X3HR  35801
6    X4HR  34154
7    X5HR  33068
8    X6HR  32529
9    X7HR  31982
10   X8HR  30961
11   X9HR  28323
12  X10HR  27869
13  X11HR  28172
14  X12HR  28501
15  X13HR  28202
16  X14HR  28227
17  X15HR  28147
18  X16HR  28313
19  X17HR  28683
20  X18HR  30921
21  X19HR  32879
22  X20HR  33038
23  X21HR  34031
24  X22HR  34684
25  X23HR  37444
26  X24HR  38160

In [321]:
elec_melt = elec.melt(id_vars = ["YEAR", "MONTH", "DAY"])
elec_melt.head(2)

   YEAR  MONTH  DAY variable  value
0  2008      1    1     X1HR  39638
1  2008      1    2     X1HR  37425

Q variable 변수를 HOUR로, value 변수를 LOAD로 변수명을 변경하시오.

In [322]:
elec_melt = elec_melt.rename(columns = {"variable" : "HOUR", "value": "LOAD"})
# rename 메소드 : 변수명 변경
elec_melt.head(2)

   YEAR  MONTH  DAY  HOUR   LOAD
0  2008      1    1  X1HR  39638
1  2008      1    2  X1HR  37425

In [323]:
elec_melt["HOUR"] = elec_melt["HOUR"].str.replace(pat = "X", repl = "")
elec_melt.head(2)

   YEAR  MONTH  DAY HOUR   LOAD
0  2008      1    1  1HR  39638
1  2008      1    2  1HR  37425

In [325]:
elec_cast = elec_melt.pivot(index = ["YEAR", "MONTH", "DAY"], columns = ["HOUR"],
                           values = ["LOAD"]).reset_index()
elec_cast.head(2)

      YEAR MONTH DAY   LOAD                                            ...  \
HOUR                   10HR   11HR   12HR   13HR   14HR   15HR   16HR  ...
0     2008     1   1  27869  28172  28501  28202  28227  28147  28313  ...
1     2008     1   2  37967  38853  39103  36666  37691  38213  38132  ...


HOUR   23HR   24HR    2HR    3HR    4HR    5HR    6HR    7HR    8HR    9HR
0     37444  38160  37682  35801  34154  33068  32529  31982  30961  28323
1     42008  42150  35239  33568  32171  31616  31725  32575  34090  35604

[2 rows x 27 columns]

In [326]:
elec_cast = elec_melt.pivot_table(index = ["YEAR", "MONTH", "DAY"], columns = ["HOUR"],
                                values = ["LOAD"]).reset_index()
elec_cast.head(2)
# pivot 은 연산불가, pivot_table 은 연산가능

      YEAR MONTH DAY   LOAD                                            ...  \
HOUR                   10HR   11HR   12HR   13HR   14HR   15HR   16HR  ...
0     2008     1   1  27869  28172  28501  28202  28227  28147  28313  ...
1     2008     1   2  37967  38853  39103  36666  37691  38213  38132  ...


HOUR   23HR   24HR    2HR    3HR    4HR    5HR    6HR    7HR    8HR    9HR
0     37444  38160  37682  35801  34154  33068  32529  31982  30961  28323
1     42008  42150  35239  33568  32171  31616  31725  32575  34090  35604

[2 rows x 27 columns]